abandon
abandons
ability
abrupt
absolutely
abstain
abstention
abundance
abundant
abundantly
abuse
abuses
abusively
accelerate
accept
acceptable
acceptance
access
accessible
accidentally
accompanied
accompany
accomplish
accumulate
accumulated
accumulation
accuracy
accurately
accusation
achievable
achieve
achieved
achievement
acknowledge
acknowledged
acquire
activation
actually
adaptable
addiction
additional
addressed
adequate
adequately
adhere
adheres
adjust
adjustment
adjusts
administer
administered
admirably
admiration
admired
admiring
admission
admit
admitting
adopt
adopting
adoption
advance
advanced
advancement
advances
advantage
advantages
advent
adverse
adversely
adversities
adversity
adverts
affecting
affordable
aggressively
allegedly
alleviation
alliance
alliances
allocate
allocation
allot
allotted
alter
alteration
altered
alternatively
ambiguity
ambiguous
ambiguously
ambition
ancestors
ancient
anniversary
annually
anticipation
anxious
apologise
apparently
appeal
appearance
application
appoint
appointed
appreciate
appreciation
approach
approached
appropriate
appropriately
approval
approve
approves
approximately
arbitrarily
arbitrary
ardently
arguably
argue
arguing
arrange
arranging
articulate
articulated
artificially
aspiration
assess
association
assume
assumption
assurance
astonished
attach
attached
attachment
attain
attainable
attempt
attentively
attitude
attract
attracted
attraction
attribute
attributed
auction
availability
available
average
avoid
avoidable
avoidance
avoids
awareness
balance
barrier
basic
belongings
beneficial
benefit
bizarre
blend
blindly
boost
borrow
breakdown
breakthrough
brief
calculation
capabilities
capability
capacity
capture
capturing
casual
casually
cause
causing
cautionary
cautiously
ceaseless
celebration
challenge
challenging
choose
chronic
circulate
circulated
circumstance
circumstances
clarification
clarity
classification
closely
clumsy
coherently
coincidence
coincidentally
collaborate
collaboration
colleagues
collect
collected
collection
combat
command
commands
comment
commitment
committed
common
comparable
comparatively
compatible
compelling
compete
competence
competencies
competition
competitive
compile
complain
complaint
complementary
complete
completely
complicating
compliment
component
components
composition
comprehensive
comprehensively
comprised
comprises
compulsion
compulsorily
compulsory
conceal
concealed
concern
concerns
conclusion
conclusively
condition
conduct
confidential
confidentially
confirm
confirms
conflict
conflicting
conflicts
conform
conformity
confront
confuse
confusing
consecutively
consented
consents
consequence
consequences
consequent
consequently
consider
considerable
considerably
considerately
consistent
consistently
constant
constrain
constrained
constraint
constraints
construction
constructive
consult
consulted
consults
consume
contain
contamination
contend
contends
contradict
contradicted
contradiction
contribute
contributed
contribution
control
controversial
controversially
controversies
controversy
convenient
conveniently
convention
conventional
conventionally
conversation
converses
conversion
convert
convertible
convertibly
convey
convince
cooperate
correctly
corrupt
corruption
counter
create
critical
critically
crowded
crucial
cultivate
current
curtail
curtailing
damaging
dampening
dangerous
dangerously
debatable
decently
deception
deceptive
decide
decisive
decisively
declare
decline
declines
decrease
dedicate
dedicated
dedicates
dedication
defeat
defeated
defeating
defect
defend
defensively
deficiencies
deficiency
deficiently
deficit
definite
deformities
deformity
degradation
degree
delay
delete
deliberate
deliberately
delicate
delicately
deliver
delivery
delusion
demand
demanding
deniable
deniably
densely
dependent
deprivation
deprived
derive
description
descriptive
designated
designation
desirable
desperately
destroy
destroyed
destruction
detect
detectable
detected
detecting
deteriorate
deteriorated
determination
determine
determined
deterrent
deterrents
detrimental
devastating
devastation
develop
developing
development
devoted
diagnosis
differ
differed
difference
differentiate
difficult
difficulty
digress
diligent
dimension
diminish
diminished
disadvantaged
disappear
disapproval
disapprove
disapproving
disastrous
discern
discourage
discovers
discriminating
discrimination
discussion
dismissed
dismisses
dispel
displacement
displayed
displaying
disposable
disputably
disqualified
disrupt
disruptive
disrupts
dissolves
dissolving
distinct
distinction
distinctive
distinguish
distinguished
distortion
distract
distraction
distribution
disturb
disturbance
disturbances
diverse
diversions
diversities
diversity
divide
division
divisively
domestic
dominantly
doubtful
dramatic
dramatically
drastically
drawback
drawbacks
durability
durable
eager
early
eccentrically
edible
efficiency
efficient
efficiently
elaborate
elaborately
election
eligible
eligibly
elimination
embarrassing
emerge
emerged
emigrate
emigrated
emotion
employ
employed
enabled
endlessly
endurable
endurance
endure
endures
enormous
enormously
enrichment
ensures
entertain
entirely
entitled
equally
equation
equipment
equivalent
eradicate
eradicated
eradicates
eradicating
erroneous
escalate
especially
essential
establish
establishment
estimate
estimated
estimates
evenly
eventually
evidence
evident
exaggeratedly
examination
examine
excavate
excavated
exceed
exception
exceptional
excessive
excessively
exchange
excited
excitedly
exclusive
exclusively
excuse
exertion
exhausted
exhausting
expand
expansion
expect
expectation
expedition
expenditure
expenditures
expense
expenses
expire
expires
explain
explained
explanation
explanatory
explicable
explicit
explicitly
explore
explorers
exponentially
exposure
express
expressing
extending
extension
extensively
external
externally
extract
extraction
extraordinarily
extravagantly
facilitate
facilitated
facility
failure
fallacy
familiar
familiarity
familiarly
fasten
fatally
favourable
favourably
feasibly
features
fertile
fetch
fierce
fiercely
firmly
flexible
flexibly
float
flourish
fluctuates
fluently
forbid
forbidding
forecast
forecasts
formally
formerly
fortunate
fortunately
founded
fragile
frankly
frequent
frequently
fresh
frozen
frustrating
frustration
fulfilling
function
fundamentally
futile
gather
generally
generously
gentle
gently
giant
globally
gradual
gradually
ground
growth
guidance
habitable
habits
handle
happen
hardly
harmful
harshly
hazardously
heavily
hectic
hesitant
hesitantly
hesitate
hesitation
hidden
hiding
highlight
highly
hinder
honours
hospitable
hostile
humid
ideally
identical
identically
identification
identifies
identify
ignorant
ignore
ignores
ignoring
illegible
illustrate
image
images
imitation
immeasurable
immediate
immense
immensely
immerse
impartial
impartially
impatient
impatiently
impenetrable
implement
implementation
implementing
implication
implicit
implicitly
implied
implies
imply
impolitely
important
importantly
impose
impression
impressions
impressively
improper
improperly
improve
improvement
inaccessible
inaccurately
inadequate
inadequately
incautiously
incentives
incidence
incident
incidentally
incidents
inclination
included
inclusion
incompetently
incompletely
inconvenient
incorporated
incorporating
increase
increasing
independent
independently
indicative
indifferent
indispensable
induce
induced
industry
ineffectively
inequitably
inevitable
inevitably
inexplicable
inferior
inferiority
influence
influential
inform
informed
informing
inhabit
inhabited
inherit
inheritance
inherits
inhibition
initial
initially
initiate
initiatives
injured
innately
innocent
innovatively
inquiry
inseparable
insight
insignificant
insist
insisted
inspection
inspiration
install
installed
instantaneous
instantly
instigate
instinct
instinctively
instruction
insufficient
insufficiently
insurance
intact
integration
intensely
intention
intentional
intentionally
interact
interactive
interacts
interchangeably
interference
interrupt
interrupting
interruption
intervals
intervenes
intervention
intricately
intriguing
intuitive
intuitively
invaluable
invasion
invasions
invention
invents
investment
invisible
invitation
ironic
ironically
irrational
irrationally
irregular
irrelevant
irresistible
irresponsibly
irreversible
irrigate
isolation
jeopardise
jeopardised
jeopardy
jointly
judgement
justification
kindly
lacks
launch
launches
leave
lectures
legitimate
limitation
limited
limiting
literally
loyally
lucky
magnified
magnify
maintain
maintaining
maintenance
malicious
manage
mandate
mandated
mandatory
manifest
massive
materials
measure
measurement
measures
mediation
mediocre
memorable
memorial
memory
merely
meticulous
minor
miserably
misleading
missing
mistake
mistakenly
mitigation
moderately
modern
modify
moisture
monthly
movement
multiply
mutually
mystery
narrow
narrowly
natural
naturally
nearly
necessary
necessities
necessity
neglect
neglected
negligible
negotiates
negotiation
nomination
normally
notable
notably
notorious
notoriously
nourish
nourished
nourishes
nutrients
nutritious
object
objection
objective
objectively
objectives
obligation
obligatory
obscurely
observable
observation
observed
obsolete
obstacle
obtain
obviously
occasionally
occupation
occupy
occurred
occurrence
occurrences
offend
offensive
offensively
offer
openly
operate
operated
opportunity
opposed
opposite
opposition
originally
outbreak
outcome
outcomes
outdated
outweigh
overcame
overcome
overcoming
overlook
overtake
overtly
overtook
partially
particularly
partly
passengers
passively
pattern
patterns
pause
peculiar
peculiarly
penalty
penetrable
penetrate
penetrated
perception
perform
performs
permanent
permanently
permission
perpetuate
persistence
persistently
persuade
persuaded
pervasive
pinpoint
politely
pollute
pollutes
possess
postpone
postpones
potentially
practical
practice
precede
preceded
precious
preciously
precise
precisely
predict
predictable
prediction
predicts
predisposition
predominantly
preferred
prejudice
preliminary
prescription
presently
preservation
pretend
pretended
prevalence
prevent
prevention
preventive
previous
previously
primary
priority
privately
privileged
productive
productively
proficiency
profit
profitable
profoundly
progressing
progressively
prominent
promise
promptly
proper
properly
property
proposal
proposals
prospect
protect
protects
provable
provided
provoke
provoked
proximity
public
publicly
punishment
purchase
purchasing
purely
purpose
qualification
qualify
quality
quantity
quarrel
quarrelled
questionable
questionably
quiet
raise
randomly
range
rapidly
react
reactive
readily
realise
reasonable
reasonably
reasons
rebellion
receipt
receive
received
recession
recklessly
recognise
recognition
recollect
recovery
recycle
reduce
reduction
redundant
redundantly
refer
reference
refine
refinement
reflect
reflectively
refuse
refuses
refusing
refutable
regard
regret
regular
regularity
regularly
regulate
reinforcement
reject
rejected
related
relative
relatively
relaxing
release
relevant
relieve
relieved
reluctance
reluctant
reluctantly
remained
remarkable
remedy
remove
removes
repair
repeating
repetitive
replace
replacing
reprimanded
reputation
requirement
requisites
rescue
resemblance
reserved
resignation
resilience
resist
resistance
resisting
resolution
resolve
resorts
resources
respect
respectable
respectively
respond
responses
restrain
restrained
restraining
restrict
restricted
restriction
restrictive
result
reveal
revealed
reversible
revival
revive
revived
revolutionise
revolutionised
rigid
rigorous
risky
roughly
safety
scarcely
scarcity
sceptical
search
security
segregation
selective
selfishly
sensitive
sensitively
sentenced
separate
separately
separation
severe
severely
severity
sheltered
shield
shortcoming
shortcomings
significant
significantly
similar
similarly
simple
simultaneous
simultaneously
sincerely
slightly
smart
smoothly
socially
solely
solution
sophisticated
specially
specifically
specify
specifying
speculate
speculated
speculates
speculative
spiritual
spoil
spoiled
spoiling
spontaneously
spread
stable
steadily
sticks
stimulate
stimulates
stimulating
straightforward
strange
strangers
strengthens
stretch
strict
strictly
structure
submission
subscribe
substances
substantial
substantially
substitute
substituted
subtle
subtly
successful
suddenly
suffer
suffered
sufficiency
sufficient
sufficiently
suggestion
suitable
suitably
superficially
superfluous
superiority
supplementary
supply
support
suppress
suppressed
suppressing
surpass
surrender
surrendered
susceptibility
susceptible
suspect
suspend
suspending
suspension
suspicions
suspicious
suspiciously
sustain
sustainable
sustainably
swift
sympathetic
symptoms
synthetically
tackle
tackling
target
taste
tediously
temperature
temporarily
temporary
temptation
tended
tendencies
termination
thoroughly
thoughtful
threaten
threatening
tight
tightly
totally
traditional
traditionally
transaction
transform
transformation
transmission
transmit
transmitted
transparent
treat
treatment
tremendous
tremendously
trigger
triggering
triumph
triumphs
trivial
truly
typically
ultimate
ultimately
unaltered
unbearable
unbearably
unclearly
unconsciously
unconventional
undermined
undermining
underwent
undesirable
unearth
unearthed
unethical
uneven
unfairly
unfamiliar
unfortunately
unify
uninhabited
uniquely
unlikely
unprecedentedly
unreasonable
unreliable
unremarkable
unresolved
unrespectable
unsophisticated
unstable
unwilling
urgency
urgent
urgently
useful
utilisation
utterly
vague
vaguely
valid
validate
validation
value
variable
variance
varied
variety
various
venue
viable
victory
vigorous
violate
violation
virtual
virtually
visible
vital
vividly
vulnerability
vulnerable
wander
wanders
waste
weaken
weakens
wealthy
weights
widespread
wilful
willing
withdraw
withdrawal
withdrawals
withstand
worsen
worthwhile
wounded