aambwaw
abandon
abduct
abort
abrupt
abruptly
absence
absolutely
absorb
absorbed
abstract
absurd
abundant
abuse
accelerate
accelerates
acceptable
acceptance
access
accommodate
accompany
accordance
account
accounted
accounts
accumulate
accurate
accurately
accused
aceleyle
acknowledge
actually
acute
adamantly
adapt
aday
address
adequate
adjacent
adjust
adjustment
adolescence
adolescent
adopt
adore
adorn
adult
adults
advance
advent
adventurous
adverse
advocate
affected
affluent
after
aggozlu
aggravated
agony
agreeable
agreement
aksan
alert
alev
algakgonullu
allege
allocate
allow
allowance
along
alter
amazement
amend
among
ample
analyze
ancestor
ancestors
anlagma
anlam
announced
annoys
annual
annually
anormal
answer
antrenor
apparent
apparently
appeal
appear
appearance
appears
apply
approach
approval
approve
approves
arable
argue
argued
around
arouse
aroused
arrange
arrogant
artefacts
arts
asansor
ascend
aspect
aspects
assemble
assert
assess
assessment
assume
assure
atasozu
ategleme
attend
attended
attract
attracted
author
avalanche
avenue
awful
awkward
aynen
bagkent
baked
balance
balanced
band
bang
baraj
bare
barely
barren
barter
base
based
baseless
battle
bayat
beam
bear
beats
before
beklenen
belong
below
bend
beneath
benefactor
benzer
berbat
between
beverage
beverages
beware
beyond
blame
blank
blast
blatant
blaze
bleed
blow
blunt
blurred
blurry
boastful
boastfully
bocek
bogluk
bogulma
bold
bolme
bolum
boost
booth
border
borg
bother
bounce
bound
boundary
bowl
boycott
boyut
bozulma
branches
brand
brave
break
breed
broad
broadcast
brow
brutal
brutally
budget
buhar
bulamk
bulgu
bulvar
bump
bumper
bumpy
burst
bury
butge
butuncu
buyuk
cactus
calculate
cancel
cancelled
capture
carefree
careless
carve
case
cast
casual
casualty
ceased
central
cereal
cesur
cesurca
challenge
charge
chart
chase
chases
check
cheerful
chop
clear
clearly
clergy
clever
cloakroom
clumsy
cluster
cnlomnlw
coach
coal
coarse
cogunluk
coherence
coherent
collaborate
collapse
collect
colossal
combat
comert
comertge
comet
command
commands
commerce
commonly
commonwealth
comparable
compare
compartment
compass
compel
competent
complete
compose
composed
compound
comprehend
compulsory
compunds
comrade
concept
concepts
conclude
concrete
condemn
condemned
condense
conduct
confessed
confront
confused
congested
connected
consequence
consequences
consequently
conserve
console
consoled
constantly
construct
consult
consumed
contact
contempt
contend
contents
contest
contestant
contests
contract
contracts
controversy
converse
conversely
convert
convey
conveyed
cool
core
correct
correctly
corrodes
costly
cottage
counsel
count
counterpart
courageous
course
courtesy
coward
cowardly
craft
craftsman
crash
crave
create
creep
crew
crops
cross
crossroad
crude
cruel
cuddle
cure
curly
currency
current
currently
custody
customs
cute
dalgalanma
damage
damp
daralma
date
dayamlmaz
dayanan
deadly
deaf
debt
debut
decade
decades
decay
decayed
decease
decent
declare
decrease
decreased
decreases
deduct
deeply
defeat
defect
defects
deger
degrade
dehydrate
dehydrated
delay
delegate
delete
demand
demanded
demonstrate
demonstrated
deneysel
denk
denote
dense
denser
dent
deny
depart
dependence
dependent
depleted
depo
deprem
derhal
descend
descendant
desert
deserve
desperate
destroyed
detect
deter
deterrence
deterrent
detest
devasa
devastate
develop
development
devoted
devre
dezavantaj
dlumcul
document
dogal
dolu
donate
donmug
donor
dormant
dosya
double
doubtful
dough
doze
draft
draw
drawback
drawbacks
dreadful
dreary
drought
drown
drowsy
drunk
dugmanca
dull
dump
dumped
dungeon
durable
duragan
durgun
durgunluk
durum
duty
duygusal
earn
earnest
ease
edge
educate
effect
effortlessly
eject
eklem
elaborate
elderly
elect
elegant
eleman
eleme
elevate
embarrassed
emerge
employ
employment
enable
enables
enact
encompass
encompasses
encountered
encourage
endure
enemy
enforce
engel
engelleme
enhance
enlarge
enlargement
enormous
ensure
entangled
equal
equally
erode
erozyon
error
erupt
esaret
esasen
escalate
essence
eternal
eternally
etymology
evade
evaluate
evaporate
eventual
eventually
evolved
exactly
exaggerate
exaggerated
excavate
excavates
exceed
exceeds
except
excess
exchanged
exclude
excrete
execute
exert
exhale
exhaust
exhausted
expand
expanded
expands
expectancy
explanatory
explode
exploded
explore
export
exposed
express
extend
extends
external
extract
extravagant
extreme
extremely
extrovert
fabulous
fact
factory
fade
fake
fallacy
falsehood
fame
faraway
fare
farewell
fark
fatal
fate
fateful
fault
faultless
faulty
fauna
favour
favourable
fayda
fear
feast
feather
feature
features
fedakarca
feeble
feedback
fellow
female
fence
ferry
fetch
fever
fewer
flamboyant
flammable
flat
flatter
flavour
flawless
fleet
float
flood
flooded
fluctuate
fluent
fluently
focus
focused
fold
folk
follow
fond
footnote
forces
forecast
forehead
foremost
foresee
foretell
forged
forgery
forgetful
form
formal
formally
formed
former
formerly
formulate
fortunate
fortune
foster
found
founded
fragrant
frame
framework
frank
fraternal
fraud
freak
freckle
frequent
frequently
fresh
freshman
frozen
frustrate
frustrated
fuel
fundamental
fungus
fuss
fuzyon
gadget
gamur
gamurlu
garbage
gasp
gatal
gather
gaze
gelenek
geleneksel
gender
generate
generous
gently
gergek
gesture
gete
gevgek
gevgekge
gevsek
glad
glamorous
glaze
global
gloomy
glow
goddess
gogebe
gogmen
goods
gorev
gosterge
govern
gozum
grab
graceful
gradual
gradually
graduate
grant
grape
grass
grateful
graze
greedy
greets
groans
groom
groups
guard
gubre
guess
guest
gulung
gurume
gururla
gururlu
halt
hamper
handle
handsome
handy
hangover
haphazard
happen
hardly
hareket
harmful
harmless
harsh
harvest
harvested
hasar
hasty
hata
hatch
hatches
hatred
haven
hayal
hazardous
healthy
heart
heavenly
hedef
helpless
herd
heterogeneous
heyecan
hhwb
hoggorulu
hoggorusuz
hold
hollow
homogeneous
honest
hopeful
hopeless
host
hostage
huge
humble
humbly
humorous
humorously
huzurlu
huzursuzluk
jealously
jeopardy
jewellery
joyful
judge
judgement
judgements
jukebox
jumble
juncture
jungle
junk
kaba
kabul
kader
kagak
kahraman
kaktus
kamt
kapak
karamsarca
kargaga
kavram
kaygan
kaynak
kazang
keder
keen
kehanet
kneel
knob
knot
knowledgeable
kocaman
koku
kokusuz
kolayca
komgu
konugma
konuksever
korkak
korkmug
korkung
korkusuzca
koro
koruma
kotumser
koylu
kumar
kumas
kume
kupumseme
kurgu
kurnaz
kurtaj
kurulum
kurum
kurumsal
kusur
kusursuz
kutlama
kutsal
kuwet
label
labelled
labour
lack
lame
landmark
landscape
lane
lash
last
lately
latter
laugh
launch
layer
lazy
lead
lease
leather
lecture
leftovers
legacy
lense
lessen
lethal
level
lever
leverage
loaf
loan
loathe
local
locate
located
lodge
loose
loosely
loss
losses
lottery
lousy
lovely
loyal
lump
maammsamamaaeam
mahkum
mahvetme
major
manage
management
manevra
manor
manual
manufacture
manzara
marka
markedly
market
marrow
marvellous
masraf
mass
master
mastery
masum
masumca
matched
matter
mature
maya
mean
means
measure
meek
membrane
memnun
mentally
mentege
mentor
mercek
mere
merely
merge
merhametle
mesafe
messy
metaphor
mevcut
mmmamam
mmmmmmmmmmsa
moda
moderate
modest
momentous
money
moody
mortal
mournful
mudahele
muddy
muhtegem
muhtemelen
muscle
muscles
mutual
mutually
mystery
naked
namussuz
namussuzca
narrate
narrow
nasty
natural
nature
naughty
naval
near
nearby
neared
nearly
neat
necessary
needle
needless
negeyle
neglectful
neredeyse
nervous
nervously
network
noble
nocturnal
nomad
nonsense
notable
nucleus
numb
numerous
obey
obscure
observe
obsolete
obstacle
obstacles
obstruct
occupy
occur
occurrence
occurs
odorless
odourless
offence
offend
offer
offshore
ofke
ofkeyle
ogretmen
olaganustu
olay
oldurucu
olgun
olugum
olumcul
omurga
onay
onboard
onem
onlooker
onward
operate
opponent
opponents
oppose
oppress
orally
oran
order
orderly
orman
ornament
ornek
ortulmug
otoyol
outbreak
outcome
outlaw
outnumber
output
outrageous
outward
overcharge
overcome
overdue
overhear
overlook
overrate
oversee
overstate
overthrow
ozel
ozenle
pace
pale
palm
parade
paralyze
parlak
partly
pash
paslanma
pass
path
pattern
pause
peaceful
peak
peasant
pebble
peel
peer
peers
penetrate
percent
perfect
perform
permanent
perpetual
persecute
personally
persuade
phase
phenomena
phenomenon
phrase
place
plague
platoon
plea
plead
pleasant
pledge
plough
plumber
plunge
pole
poll
polluted
poor
porous
portable
porter
portrayal
pose
possess
posta
postulate
posture
pour
poverty
preceded
predator
predators
preface
preferably
pregnant
premature
prematurely
prepare
present
preserve
preserved
pressure
presumably
pretend
prevalent
prevent
prevented
probable
procedure
process
produce
product
profound
prolong
promote
prompt
prone
proof
propel
proper
property
prophecy
prophet
propose
proposed
prose
prospect
protect
protected
prototype
protrude
prove
proverb
prudent
pseudonym
puberty
puddle
pullover
punctual
purchase
pure
purely
purest
purposeful
pursue
qogunluk
quake
quarrel
quarterly
quench
quest
queue
quote
race
rage
rahatlama
random
range
ranged
rank
ranked
rare
rarely
rash
rastgele
rate
ravage
reach
react
realm
reason
reasonable
rebel
rebels
recall
recede
recently
reckless
recklessly
reckon
recollect
recommend
reconstruct
record
recover
recurrent
recycled
reduce
reduced
redundancy
redundant
referee
referred
reflect
refresh
refugee
refugees
refund
regard
regarded
regardless
regularly
regulate
rehearsal
rehearse
reject
relate
relay
release
released
relentless
relevance
reluctant
rely
remarkable
remnant
remote
remove
rendezvous
renounce
renovate
renowned
repel
replace
represent
request
requests
rescue
research
resemblance
resemble
resented
resentment
reserve
resolve
resort
resource
resourceful
resources
respect
respectable
respectful
respond
responded
restless
restore
results
retarded
retreat
retrospect
revenue
reverse
revolt
revolves
reward
rezervuar
rhyme
road
roam
rock
roll
romance
rough
roughly
roughness
rubber
rubble
rude
rugged
rumour
runaway
runway
rupture
rural
rush
rust
rusty
ruthless
rutubet
ruzgar
sacred
sadakat
sadece
safga
saglam
sahne
sahte
sale
salvage
samples
sanal
sansasyonel
savage
save
savurgan
scale
scarce
scarcely
scare
scared
scary
scatter
scene
scenery
scent
schedule
scornful
scrape
scratch
scream
screen
scruffy
search
secluded
secondary
secrete
secure
sedentary
seek
sefalet
segenek
select
self
selflessly
sense
sensory
separate
sert
settle
severe
seyrek
shabby
shaggy
shallow
shame
shameful
shameless
shape
share
sharp
sharply
shatter
shed
shell
shelter
shepherd
shortage
shortly
shovel
shrunk
shuffle
shutter
skeleton
skull
slang
slaughter
sleet
slender
smart
smash
smooth
smudge
smuggle
sneak
soaked
sober
software
soguk
solely
solgun
soluk
solve
somewhat
sonsuz
sonug
sorrow
sorrowful
sorrowfully
sort
sorumlu
sorumsuzca
sour
soyut
soyutlama
sozel
spade
span
spare
sparkle
sparse
sparsely
speculated
speed
sphere
splendour
spontaneous
spontaneously
spot
spray
stable
staff
stage
stagnant
stale
stammer
staple
startle
starve
state
statu
statue
status
steady
steam
steep
steer
stock
stomach
storage
stranded
strands
strangle
strengthen
strenous
strenuous
stretch
stroke
structure
struggle
stubborn
stuff
sturdy
subsequent
subsequently
substance
suburb
succeed
succeeded
suck
suffered
suffocate
suggest
suglama
suglu
sulama
sulu
summon
superb
supplement
supply
support
suppress
surface
surgeon
surgun
surmounted
surpass
surround
surrounded
surtunme
suru
suruklenme
surungen
survey
suspend
suspense
swallow
swan
swap
swarm
sweat
sweep
swell
swollen
syllable
sympathy
syndrome
tabaka
tackle
tactful
tactless
talent
talented
tamamen
tame
tamed
tampon
target
taslak
tasteful
tasteless
tasty
taze
tear
tembel
temper
temperate
temporary
tempted
tenant
tend
tender
tense
tepe
tereddutlu
terms
tesaduf
them
thesaurus
thorn
thorough
thoughtful
thoughtless
thread
threatened
threats
throat
throne
through
throughout
thunder
tolerance
tolerant
tolerate
tomb
toprak
torch
tornado
torun
tough
towards
tract
trade
tram
transfer
transform
translate
trap
trapped
treachery
treason
treat
tremendous
tremendously
tremor
troops
troublesome
truck
trustworthy
tuck
tuhaf
tukuruk
tumble
tummy
turn
turnover
tutku
tutkulu
tutkuyla
tutor
tuxedo
tuzak
tyranny
tyrant
ucret
ugly
ugucu
ugug
umutsuz
umutsuzluk
unable
unbearable
uncover
under
undergo
underrate
undertake
undo
undoubtedly
unease
unexpected
unexpectedly
unfolded
unpleasant
unprecedented
unusual
unutkan
update
upheaval
upkeep
uproot
urban
urgent
usher
usual
utangag
utanmaz
utmost
utter
utterly
uydu
uygulama
uygun
uykulu
uyum
uzak
uzlagma
uzucu
vacant
vague
vaha
valley
valuable
value
valueless
vapour
vast
vehement
venom
venture
verbal
verbally
vessel
vocabulary
volume
volumes
volunteer
vote
voyage
vulgar
vulture
vurgulayarak
vurgulu
wages
wasteful
wealthy
wears
wheel
wholesale
wonder
worm
worthless
wound
wounded
wrap
wrapped
wreck
wrtamous
yapamaz
yapay
yara
yard
yarda
yasaklama
yasama
yatay
yawn
yazar
yeast
yetenek
yogun
yolculuk
yorgunluk
yorucu
yorunge
yumruk
yumusak
yuzeysel
zorlama
zorunlu