abandon
abandons
ability
abrupt
absolutely
abstain
abstention
abundance
abundant
abundantly
abuse
abuses
abusively
accelerate
accept
acceptable
acceptance
access
accessible
accidentally
accompanied
accompany
accomplish
accumulate
accumulated
accumulation
accumulations
accuracy
accurately
accusation
accusations
achievable
achieve
achieved
achievement
acknowledge
acknowledged
acquire
activation
actually
adaptable
addiction
addictions
additional
addressed
adequate
adequately
adhere
adheres
adjust
adjustment
adjustments
adjusts
administer
administered
admirably
admiration
admired
admiring
admission
admit
admitting
adopt
adopting
adoption
advance
advanced
advancement
advances
advantage
advantages
advent
adverse
adversely
adversities
adversity
adverts
affecting
affordable
aggressively
allegedly
alleviation
alliance
alliances
allocate
allocation
allot
allotted
allow
alter
alteration
altered
alternatively
ambiguity
ambiguous
ambiguously
ambition
amusingly
analysis
ancestors
ancient
anniversary
annually
anticipation
anxious
apologise
apparently
appeal
appearance
application
applications
apply
appoint
appointed
appreciate
appreciation
approach
approached
appropriate
appropriately
approval
approve
approves
approximately
arbitrarily
arbitrary
ardently
arguably
argue
arguing
arrange
arranging
articulate
articulated
artificial
artificially
aspiration
aspirations
assess
assessments
association
associations
assume
assumption
assurance
astonished
attach
attached
attachment
attain
attainable
attempt
attentively
attitude
attract
attracted
attraction
attribute
attributed
auction
availability
available
average
avoid
avoidable
avoidance
avoids
awareness
badly
balance
barrier
basic
beat
belongings
beneficial
benefit
bizarre
blend
blindly
boost
borrow
breakdown
breakthrough
brief
briefly
broadly
calculation
calculations
calm
capabilities
capability
capacity
capture
capturing
carefully
casual
casually
cause
causing
cautionary
cautiously
ceaseless
celebration
challenge
challenging
choose
chronic
circulate
circulated
circumstance
circumstances
clarification
clarity
classification
clearly
close
closely
clumsy
coherently
coincidence
coincidentally
collaborate
collaboration
colleagues
collect
collected
collection
combat
command
commands
comment
commitment
commitments
committed
common
commonly
comparable
comparatively
compatible
compelling
compete
competence
competencies
competition
competitions
competitive
compile
complain
complaint
complementary
complete
completely
complicating
compliment
compliments
component
components
composition
comprehensive
comprehensively
comprised
comprises
compulsion
compulsorily
compulsory
conceal
concealed
concern
concerns
conclusion
conclusively
condition
conduct
confidential
confidentially
confirm
confirms
conflict
conflicting
conflicts
conform
conformity
confront
confuse
confusing
consecutively
consented
consents
consequence
consequences
consequent
consequently
conservation
consider
considerable
considerably
considerately
consistent
consistently
constant
constantly
constrain
constrained
constraint
constraints
construction
constructive
consult
consulted
consults
consume
contain
contamination
contend
contends
contradict
contradicted
contradiction
contribute
contributed
contribution
control
controversial
controversially
controversies
controversy
convenient
conveniently
convention
conventional
conventionally
conversation
converses
conversion
convert
convertible
convertibly
convey
convince
convincingly
cooperate
correctly
corrupt
corruption
corruptions
cosy
counter
create
critical
critically
crowded
crucial
cultivate
cure
curiously
current
currently
curtail
curtailing
damaging
dampening
dangerous
dangerously
daringly
debatable
decently
deception
deceptions
deceptive
decide
decisive
decisively
declare
decline
declines
decrease
dedicate
dedicated
dedicates
dedication
defeat
defeated
defeating
defect
defend
defensively
deficiencies
deficiency
deficiently
deficit
definite
deformities
deformity
degradation
degree
delay
delete
deliberate
deliberately
delicate
delicately
deliver
delivery
delusion
demand
demanding
deniable
deniably
densely
dependent
deprivation
deprived
derive
description
descriptive
designated
designation
designations
desirable
desperately
destroy
destroyed
destruction
detect
detectable
detected
detecting
deteriorate
deteriorated
determination
determine
determined
deterrent
deterrents
detrimental
devastating
devastatingly
devastation
develop
developing
development
devoted
diagnosis
differ
differed
difference
differentiate
difficult
difficulty
digress
diligent
dimension
diminish
diminished
disadvantaged
disappear
disapproval
disapprove
disapproving
disastrous
discern
discourage
discovers
discriminating
discrimination
discussion
dismissed
dismisses
dispel
displacement
displayed
displaying
disposable
disputably
disqualified
disrupt
disruptions
disruptive
disrupts
dissolves
dissolving
distinct
distinction
distinctions
distinctive
distinguish
distinguished
distortion
distortions
distract
distraction
distribution
disturb
disturbance
disturbances
diverse
diversions
diversities
diversity
divide
division
divisively
domestic
dominantly
doubtful
doubtfully
dramatic
dramatically
drastically
drawback
drawbacks
durability
durable
eager
early
easily
eccentrically
edible
efficiency
efficient
efficiently
elaborate
elaborately
election
eligible
eligibly
elimination
embarrassing
emerge
emerged
emigrate
emigrated
emotion
empirical
employ
employed
enabled
endlessly
endurable
endurance
endure
endures
enhancements
enormous
enormously
enrichment
ensures
entertain
entirely
entitled
equally
equation
equipment
equivalent
eradicate
eradicated
eradicates
eradicating
erroneous
escalate
especially
essential
establish
establishment
estimate
estimated
estimates
evenly
eventually
evidence
evident
exactly
exaggeratedly
examination
examine
excavate
excavated
exceed
exception
exceptional
excessive
excessively
exchange
excited
excitedly
exclusive
exclusively
excuse
exertion
exhausted
exhausting
expand
expansion
expect
expectation
expectations
expedition
expeditions
expenditure
expenditures
expense
expenses
expire
expires
explain
explained
explanation
explanatory
explicable
explicit
explicitly
explore
explorers
exponentially
exposure
express
expressing
extending
extension
extensively
external
externally
extinction
extract
extraction
extraordinarily
extravagantly
facilitate
facilitated
facility
fail
failure
fairly
fallacy
familiar
familiarity
familiarly
fasten
fatally
favourable
favourably
feasibly
features
fertile
fetch
fierce
fiercely
firmly
flexible
flexibly
float
flourish
fluctuate
fluctuates
fluently
forbid
forbidding
forcefully
forecast
forecasts
formally
formerly
fortunate
fortunately
founded
fragile
frankly
freely
frequent
frequently
fresh
frozen
fruitfully
frustrating
frustration
fulfilling
function
functions
fundamentally
futile
gather
generally
generously
gentle
gently
giant
globally
gradual
gradually
great
ground
growth
guidance
habitable
habits
handle
happen
hardly
harmful
harshly
hazardously
heavily
hectic
hesitant
hesitantly
hesitate
hesitation
hidden
hiding
highlight
highly
hinder
honestly
honours
hopefully
hospitable
hostile
humid
ideally
identical
identically
identification
identifies
identify
ignorant
ignore
ignores
ignoring
illegible
illustrate
illustrations
image
images
imitation
imitations
immeasurable
immediate
immediately
immense
immensely
immerse
impartial
impartially
impatient
impatiently
impenetrable
implement
implementation
implementing
implication
implicit
implicitly
implied
implies
imply
impolitely
important
importantly
impose
impression
impressions
impressively
improper
improperly
improve
improvement
inaccessible
inaccurately
inadequate
inadequately
incautiously
incentives
incidence
incident
incidentally
incidents
inclination
include
included
inclusion
incompetently
incompletely
inconvenient
incorporated
incorporating
increase
increasing
increasingly
independent
independently
indications
indicative
indifferent
indispensable
induce
induced
industry
ineffectively
inequitably
inevitable
inevitably
inexplicable
inferior
inferiority
influence
influential
inform
informed
informing
inhabit
inhabited
inherit
inheritance
inherits
inhibition
inhibitions
initial
initially
initiate
initiatives
injured
innately
innocent
innovations
innovatively
inquiry
inseparable
insight
insignificant
insist
insisted
inspection
inspiration
install
installed
instantaneous
instantly
instigate
instinct
instinctively
instruction
insufficient
insufficiently
insurance
intact
integration
intensely
intention
intentional
intentionally
interact
interactive
interacts
interchangeably
interference
interpretations
interrupt
interrupting
interruption
intervals
intervenes
intervention
intricately
intriguing
intuitive
intuitively
invaluable
invasion
invasions
invention
invents
investment
investments
invisible
invitation
ironic
ironically
irrational
irrationally
irregular
irrelevant
irresistible
irresponsibly
irreversible
irrigate
isolation
jeopardise
jeopardised
jeopardy
jointly
judgement
justification
kindly
lacks
lately
launch
launches
leave
lectures
legitimate
likely
limitation
limited
limiting
literally
loudly
loyally
lucky
magnified
magnify
mainly
maintain
maintaining
maintenance
malicious
manage
mandate
mandated
mandatory
manifest
manipulations
mass
massive
materials
measure
measurement
measurements
measures
mediation
mediocre
memorable
memorial
memory
mend
merely
meticulous
minor
miserably
misleading
missing
mistake
mistakenly
mitigation
moderately
modern
modify
moisture
monthly
movement
multiply
mutually
mystery
narrow
narrowly
natural
naturally
nearly
neat
necessary
necessities
necessity
neglect
neglected
negligible
negotiates
negotiation
negotiations
nomination
normally
notable
notably
notorious
notoriously
nourish
nourished
nourishes
nutrients
nutritious
object
objection
objections
objective
objectively
objectives
obligation
obligatory
obscurely
observable
observation
observations
observed
obsolete
obstacle
obstructions
obtain
obviously
occasionally
occupation
occupy
occurred
occurrence
occurrences
offend
offensive
offensively
offer
only
openly
operate
operated
opportunity
opposed
opposite
opposition
originally
outbreak
outcome
outcomes
outdated
outweigh
overcame
overcome
overcoming
overlook
overtake
overtly
overtook
partially
particularly
partly
passengers
passively
pattern
patterns
pause
peculiar
peculiarly
penalty
penetrable
penetrate
penetrated
perception
perceptions
perform
performs
permanent
permanently
permission
perpetuate
persistence
persistently
persuade
persuaded
pervasive
pinpoint
placements
pleasingly
plentifully
politely
pollute
pollutes
possess
postpone
postpones
potentially
practical
practice
precautions
precede
preceded
precious
preciously
precise
precisely
predict
predictable
prediction
predicts
predisposition
predispositions
predominantly
preferred
prejudice
preliminary
prescription
presently
preservation
pretend
pretended
prevalence
prevent
prevention
preventive
previous
previously
primarily
primary
priority
privately
privileged
productions
productive
productively
proficiency
profit
profitable
profoundly
progressing
progressively
prominent
promise
promisingly
promptly
proper
properly
property
proposal
proposals
prospect
protect
protects
provable
provide
provided
provoke
provoked
proximity
public
publicly
punishment
punishments
purchase
purchasing
purely
purpose
qualification
qualify
quality
quantity
quarrel
quarrelled
questionable
questionably
quickly
quiet
raise
randomly
range
rapidly
rare
rarely
react
reactions
reactive
readily
realise
reasonable
reasonably
reasons
rebellion
receipt
receive
received
recently
receptions
recession
recklessly
recognise
recognition
recollect
recovery
recycle
reduce
reduction
redundant
redundantly
refer
reference
refine
refinement
refinements
reflect
reflectively
refuse
refuses
refusing
refutable
regard
regret
regular
regularity
regularly
regulate
regulations
reinforcement
reject
rejected
rejections
related
relative
relatively
relaxing
release
relevant
relieve
relieved
reluctance
reluctant
reluctantly
remained
remarkable
remedy
remove
removes
repair
repeating
repetitive
replace
replacing
reprimanded
reputation
require
requirement
requisites
rescue
resemblance
reserved
resignation
resilience
resist
resistance
resisting
resolution
resolutions
resolve
resorts
resources
respect
respectable
respectively
respond
responses
restrain
restrained
restraining
restrict
restricted
restriction
restrictions
restrictive
result
reveal
revealed
reversible
revival
revive
revived
revolutionise
revolutionised
rigid
rigorous
risky
roughly
safe
safety
sanction
scarcely
scarcity
sceptical
search
security
segregation
selective
selfishly
sensitive
sensitively
sentenced
separate
separately
separation
settlements
severe
severely
severity
sheltered
shield
shortcoming
shortcomings
significant
significantly
similar
similarly
simple
simultaneous
simultaneously
sincerely
slightly
slow
slowly
smart
smoothly
socially
solely
solution
sophisticated
span
sparingly
specially
specifically
specify
specifying
speculate
speculated
speculates
speculations
speculative
spiritual
spoil
spoiled
spoiling
spontaneously
spread
stable
steadily
sticks
stimulate
stimulates
stimulating
straightforward
strange
strangers
strengthens
stretch
strict
strictly
structure
submission
subscribe
substances
substantial
substantially
substitute
substituted
substitutions
subtle
subtly
successful
suddenly
suffer
suffered
sufficiency
sufficient
sufficiently
suggestion
suitable
suitably
superficially
superfluous
superiority
supplementary
supply
support
suppress
suppressed
suppressing
surpass
surrender
surrendered
susceptibility
susceptible
suspect
suspend
suspending
suspension
suspicions
suspicious
suspiciously
sustain
sustainable
sustainably
swift
sympathetic
symptoms
synthetically
tackle
tackling
target
task
taste
tediously
temperature
temporarily
temporary
temptation
tended
tendencies
termination
thin
thoroughly
thoughtful
threaten
threatening
tidy
tight
tightly
totally
traditional
traditionally
transaction
transform
transformation
transformations
transmission
transmit
transmitted
transparent
treat
treatment
tremendous
tremendously
trigger
triggering
triumph
triumphs
trivial
truly
typically
ultimate
ultimately
unaltered
unbearable
unbearably
unclearly
unconsciously
unconventional
undermine
undermined
undermining
underwent
undesirable
unearth
unearthed
unethical
uneven
unfairly
unfamiliar
unfortunately
unify
uninhabited
uniquely
unlikely
unprecedentedly
unreasonable
unreliable
unremarkable
unresolved
unrespectable
unsophisticated
unstable
unwilling
unwillingly
urgency
urgent
urgently
useful
usefully
utilisation
utterly
vague
vaguely
valid
validate
validation
validity
value
variable
variance
varied
variety
various
venue
viable
victory
vigorous
violate
violation
virtual
virtually
visible
vital
vividly
vulnerability
vulnerable
wander
wanders
waste
weak
weaken
weakens
wealthy
weights
wide
widely
widespread
wilful
willing
withdraw
withdrawal
withdrawals
withstand
worsen
worthwhile
wounded
yield